Revit 2026 API

# CurveByPointsUtilsValidateCurveElementIdArrayForFaceRegions Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ValidateCurveElementIdArrayForFaceRegions(
	Document document,
	IList<ElementId> curveElemIds
)
```
```vb
Public Shared Function ValidateCurveElementIdArrayForFaceRegions (
	document As Document,
	curveElemIds As IList(Of ElementId)
) As Boolean
```
```cpp
public:
static bool ValidateCurveElementIdArrayForFaceRegions(
	Document^ document,
	IList<ElementId^>^ curveElemIds
)
```
```fsharp
static member ValidateCurveElementIdArrayForFaceRegions :
        document : Document *
        curveElemIds : IList<ElementId> -> bool
```

#### Parameters

document Document

curveElemIds IListElementId

#### Return Value

Boolean

#### Reference

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace